### Import Library

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
from matplotlib import pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.metrics import confusion_matrix
from sklearn.metrics import classification_report
from keras.callbacks import ModelCheckpoint
import tensorflow as tf

### Read Datasest

In [4]:
data_dir = './dataset credit-approval/Datasets_Dummy_CreditApproval-v3.csv'
with open(data_dir, 'r') as csvfile:
    print(f"First line (header) looks like this:\n\n{csvfile.readline()}")
    print(f"Each data point looks like this:\n\n{csvfile.readline()}")

First line (header) looks like this:

ï»¿;approval;gender;usia; pinjaman;tenor;pemasukan;tanggungan;pekerjaan;donasi

Each data point looks like this:

0;N;M;53;1800000;6;1500000;1;Buruh;0

In [6]:
df  = pd.read_csv(data_dir, delimiter=';')
df.head()

,Unnamed: 0,approval,gender,usia,pinjaman,tenor,pemasukan,tanggungan,pekerjaan,donasi
0,0,N,M,53,1800000,6,1500000,1,Buruh,0
1,1,Y,M,61,500000,4,3500000,0,Guru/Dosen,3
2,2,N,M,33,1000000,6,1200000,0,Pedagang,6
3,3,N,M,37,1200000,16,1800000,5,Pekerja Lepas,5
4,4,Y,F,36,1200000,10,4600000,1,Buruh,4

In [9]:
data = df.drop('Unnamed: 0', axis=1)
data.head()

,approval,gender,usia,pinjaman,tenor,pemasukan,tanggungan,pekerjaan,donasi
0,N,M,53,1800000,6,1500000,1,Buruh,0
1,Y,M,61,500000,4,3500000,0,Guru/Dosen,3
2,N,M,33,1000000,6,1200000,0,Pedagang,6
3,N,M,37,1200000,16,1800000,5,Pekerja Lepas,5
4,Y,F,36,1200000,10,4600000,1,Buruh,4

### Change Categorical to Numeric Value

In [10]:
def Cat_to_Num(features):
    for feature in features:
        feature_list = list(np.unique(data[feature]))
        feature_dict = {}
        for i in range(len(feature_list)):
                       feature_dict[feature_list[i]] = i
        data.replace({feature : feature_dict}, inplace=True)
        print(feature, '-->', feature_dict)

In [11]:
categorical_features = ['approval', 'gender','pekerjaan']
Cat_to_Num(categorical_features)

approval --> {'N': 0, 'Y': 1}
gender --> {'F': 0, 'M': 1}
pekerjaan --> {'Buruh': 0, 'Guru/Dosen': 1, 'Pedagang': 2, 'Pekerja Lepas': 3, 'Wirausaha': 4}

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   approval    10000 non-null  int64
 1   gender      10000 non-null  int64
 2   usia        10000 non-null  int64
 3    pinjaman   10000 non-null  int64
 4   tenor       10000 non-null  int64
 5   pemasukan   10000 non-null  int64
 6   tanggungan  10000 non-null  int64
 7   pekerjaan   10000 non-null  int64
 8   donasi      10000 non-null  int64
dtypes: int64(9)
memory usage: 703.2 KB